// ============================================
// 模块：char_rom
// 功能：中文字模 ROM（16x16 点阵，每字32字节，逐行式 MSB first）
// 字索引：0=圆 1=形 2=矩  （显示：圆形=0,1  矩形=2,1）
// 地址 = {char_idx[1:0], row[3:0], byte_sel}，共 3x16x2=96 字节
// ============================================
module char_rom (
    input  wire [6:0] addr,   // 0~95
    output reg  [7:0] data
);

    reg [7:0] rom [0:95];
    initial begin
        rom[  0] = 8'h7F;  // 字0(圆) 第 0行左半
        rom[  1] = 8'hFE;  // 字0(圆) 第 0行右半
        rom[  2] = 8'h40;  // 字0(圆) 第 1行左半
        rom[  3] = 8'h02;  // 字0(圆) 第 1行右半
        rom[  4] = 8'h4F;  // 字0(圆) 第 2行左半
        rom[  5] = 8'hF2;  // 字0(圆) 第 2行右半
        rom[  6] = 8'h48;  // 字0(圆) 第 3行左半
        rom[  7] = 8'h12;  // 字0(圆) 第 3行右半
        rom[  8] = 8'h4F;  // 字0(圆) 第 4行左半
        rom[  9] = 8'hF2;  // 字0(圆) 第 4行右半
        rom[ 10] = 8'h40;  // 字0(圆) 第 5行左半
        rom[ 11] = 8'h02;  // 字0(圆) 第 5行右半
        rom[ 12] = 8'h4F;  // 字0(圆) 第 6行左半
        rom[ 13] = 8'hF2;  // 字0(圆) 第 6行右半
        rom[ 14] = 8'h48;  // 字0(圆) 第 7行左半
        rom[ 15] = 8'h12;  // 字0(圆) 第 7行右半
        rom[ 16] = 8'h49;  // 字0(圆) 第 8行左半
        rom[ 17] = 8'h92;  // 字0(圆) 第 8行右半
        rom[ 18] = 8'h49;  // 字0(圆) 第 9行左半
        rom[ 19] = 8'h12;  // 字0(圆) 第 9行右半
        rom[ 20] = 8'h43;  // 字0(圆) 第10行左半
        rom[ 21] = 8'h42;  // 字0(圆) 第10行右半
        rom[ 22] = 8'h4E;  // 字0(圆) 第11行左半
        rom[ 23] = 8'h32;  // 字0(圆) 第11行右半
        rom[ 24] = 8'h40;  // 字0(圆) 第12行左半
        rom[ 25] = 8'h02;  // 字0(圆) 第12行右半
        rom[ 26] = 8'h7F;  // 字0(圆) 第13行左半
        rom[ 27] = 8'hFE;  // 字0(圆) 第13行右半
        rom[ 28] = 8'h40;  // 字0(圆) 第14行左半
        rom[ 29] = 8'h02;  // 字0(圆) 第14行右半
        rom[ 30] = 8'h00;  // 字0(圆) 第15行左半
        rom[ 31] = 8'h00;  // 字0(圆) 第15行右半
        rom[ 32] = 8'h00;  // 字1(形) 第 0行左半
        rom[ 33] = 8'h00;  // 字1(形) 第 0行右半
        rom[ 34] = 8'h7F;  // 字1(形) 第 1行左半
        rom[ 35] = 8'h8C;  // 字1(形) 第 1行右半
        rom[ 36] = 8'h13;  // 字1(形) 第 2行左半
        rom[ 37] = 8'h18;  // 字1(形) 第 2行右半
        rom[ 38] = 8'h13;  // 字1(形) 第 3行左半
        rom[ 39] = 8'h30;  // 字1(形) 第 3行右半
        rom[ 40] = 8'h13;  // 字1(形) 第 4行左半
        rom[ 41] = 8'h20;  // 字1(形) 第 4行右半
        rom[ 42] = 8'h13;  // 字1(形) 第 5行左半
        rom[ 43] = 8'h02;  // 字1(形) 第 5行右半
        rom[ 44] = 8'h13;  // 字1(形) 第 6行左半
        rom[ 45] = 8'h04;  // 字1(形) 第 6行右半
        rom[ 46] = 8'h7F;  // 字1(形) 第 7行左半
        rom[ 47] = 8'h88;  // 字1(形) 第 7行右半
        rom[ 48] = 8'h13;  // 字1(形) 第 8行左半
        rom[ 49] = 8'h30;  // 字1(形) 第 8行右半
        rom[ 50] = 8'h13;  // 字1(形) 第 9行左半
        rom[ 51] = 8'h20;  // 字1(形) 第 9行右半
        rom[ 52] = 8'h33;  // 字1(形) 第10行左半
        rom[ 53] = 8'h02;  // 字1(形) 第10行右半
        rom[ 54] = 8'h23;  // 字1(形) 第11行左半
        rom[ 55] = 8'h06;  // 字1(形) 第11行右半
        rom[ 56] = 8'h23;  // 字1(形) 第12行左半
        rom[ 57] = 8'h0C;  // 字1(形) 第12行右半
        rom[ 58] = 8'h23;  // 字1(形) 第13行左半
        rom[ 59] = 8'h18;  // 字1(形) 第13行右半
        rom[ 60] = 8'h43;  // 字1(形) 第14行左半
        rom[ 61] = 8'h60;  // 字1(形) 第14行右半
        rom[ 62] = 8'h41;  // 字1(形) 第15行左半
        rom[ 63] = 8'h40;  // 字1(形) 第15行右半
        rom[ 64] = 8'h20;  // 字2(矩) 第 0行左半
        rom[ 65] = 8'h00;  // 字2(矩) 第 0行右半
        rom[ 66] = 8'h20;  // 字2(矩) 第 1行左半
        rom[ 67] = 8'hFE;  // 字2(矩) 第 1行右半
        rom[ 68] = 8'h20;  // 字2(矩) 第 2行左半
        rom[ 69] = 8'h80;  // 字2(矩) 第 2行右半
        rom[ 70] = 8'h3E;  // 字2(矩) 第 3行左半
        rom[ 71] = 8'h80;  // 字2(矩) 第 3行右半
        rom[ 72] = 8'h48;  // 字2(矩) 第 4行左半
        rom[ 73] = 8'h80;  // 字2(矩) 第 4行右半
        rom[ 74] = 8'h48;  // 字2(矩) 第 5行左半
        rom[ 75] = 8'hFE;  // 字2(矩) 第 5行右半
        rom[ 76] = 8'h08;  // 字2(矩) 第 6行左半
        rom[ 77] = 8'h86;  // 字2(矩) 第 6行右半
        rom[ 78] = 8'h7E;  // 字2(矩) 第 7行左半
        rom[ 79] = 8'h86;  // 字2(矩) 第 7行右半
        rom[ 80] = 8'h08;  // 字2(矩) 第 8行左半
        rom[ 81] = 8'h86;  // 字2(矩) 第 8行右半
        rom[ 82] = 8'h18;  // 字2(矩) 第 9行左半
        rom[ 83] = 8'h86;  // 字2(矩) 第 9行右半
        rom[ 84] = 8'h18;  // 字2(矩) 第10行左半
        rom[ 85] = 8'hFE;  // 字2(矩) 第10行右半
        rom[ 86] = 8'h1C;  // 字2(矩) 第11行左半
        rom[ 87] = 8'h80;  // 字2(矩) 第11行右半
        rom[ 88] = 8'h16;  // 字2(矩) 第12行左半
        rom[ 89] = 8'h80;  // 字2(矩) 第12行右半
        rom[ 90] = 8'h22;  // 字2(矩) 第13行左半
        rom[ 91] = 8'h80;  // 字2(矩) 第13行右半
        rom[ 92] = 8'h60;  // 字2(矩) 第14行左半
        rom[ 93] = 8'hFE;  // 字2(矩) 第14行右半
        rom[ 94] = 8'h40;  // 字2(矩) 第15行左半
        rom[ 95] = 8'h80;  // 字2(矩) 第15行右半
    end

    always @(*) begin
        data = rom[addr];
    end

endmodule
